/*

问题：
对于一个长度为 N 的整型数组, 如果存在三个元素 i,j,k i ≠ j ≠ k, 0 ≤ i,j,k < N) 满足如下条件:

A[i] + A[j] > A[k], 
A[j] + A[k] > A[i], 
A[k] + A[i] > A[j].

现在需要些一个程序，如果数组中含有满足条件的三个数就返回 1 否则返回 0

例如：
A[0] = 10    A[1] = 2    A[2] = 5    A[3] = 1     A[4] = 8    A[5] = 20
函数应该返回 1, 因为坐标为 i=0 j=2 k=4 的元素满足所有的判定条件(例如: A[2] + A[4] > A[0]).

A[0] = 10    A[1] = 50    A[2] = 5    A[3] = 1
函数应该返回 0.

*/

function solution(A) {
	let sum = 0;

	A.sort((a, b) => {
		return a - b;
	});

	for(let i = 0; i <A.length; i++) {
		if (A[i]  + A[i + 1] > A[i + 2]) {
			return 1;
		}
	}

	return 0;
}

/*
	这样就可以了
*/